{
	"categories": {
		"p": "Principles",
		"d": "Development",
		"t": "Testing",
		"ci": "CI / CD",
		"u": "UI / UX",
		"i": "Infrastructure",
		"s": "Security",
		"l": "Leadership",
		"c": "Consulting"
	},
	"levels": [
		"Novice",
		"Beginner",
		"Competent",
		"Proficient",
		"Expert"
	],
	"questions": [
		{
			"slug": "p",
			"questions": [
				{
					"question": "None to limited knowledge/experience.",
					"level": 0
				},
				{
					"question": "Needs instructions and clear work processes to be able to work.",
					"level": 0
				},
				{
					"question": "The primairy focus of work is within a team.",
					"level": 0
				},
				{
					"question": "Knows how to retreive and share knowledge in his/her area.",
					"level": 1
				},
				{
					"question": "Can execute simple tasks, but can not fully work independently.",
					"level": 1
				},
				{
					"question": "Begins to recognize patterns and acts accordingly.",
					"level": 1
				},
				{
					"question": "Can work independently.",
					"level": 2
				},
				{
					"question": "Supports (new) teammembers.",
					"level": 2
				},
				{
					"question": "Has a broader view on dependencies from different teams within organisation.",
					"level": 2
				},
				{
					"question": "Proactivley gaining knowledge outside his/her own domain.",
					"level": 2
				},
				{
					"question": "Structurally improves the quality within his/her area of expertise.",
					"level": 3
				},
				{
					"question": "Coaches colleagues.",
					"level": 3
				},
				{
					"question": "Can handle discussions at senior management & business level.",
					"level": 3
				},
				{
					"question": "Is seen as authority on his/her domain, inside and outside organisation.",
					"level": 4
				},
				{
					"question": "Is a visionairy, sets standards, and innovates.",
					"level": 4
				},
				{
					"question": "Has a leading role in complex cross-team and cross-discipline issues.",
					"level": 4
				},
				{
					"question": "The go-to person for approaching problems from multiple perspectives.",
					"level": 4
				},
				{
					"question": "Intuitive and analytical decision-making.",
					"level": 4
				},
				{
					"question": "Knows the in's and outs of this domain and uses that to inspire peopl.",
					"level": 4
				}
			]
		},
		{
			"slug": "d",
			"questions": [
				{
					"question": "Interprets code and makes simple adjustments to it based on clear instructions.",
					"level": 0
				},
				{
					"question": "Creates working and maintainable code in an existing codebase.",
					"level": 1
				},
				{
					"question": "If the code does not lead to the desired result, he/she can discover the issue and resolve it, but sometimes would require help.",
					"level": 1
				},
				{
					"question": "Executes simple user stories.",
					"level": 1
				},
				{
					"question": "Ensures that technical debt is kept to a minimum.",
					"level": 1
				},
				{
					"question": "Sets up and performs unit tests on own code.",
					"level": 1
				},
				{
					"question": "Prepares own changes so that they can be moved through the whole pipeline (Dev -> Tst -> Acc -> Prd).",
					"level": 1
				},
				{
					"question": "Develops new features and determines WHICH user stories/requirements must be realized and HOW.",
					"level": 2
				},
				{
					"question": "This includes software design where security, availability, scalability and other NFRs (non functional requirements) are taken into account.",
					"level": 2
				},
				{
					"question": "Evaluates and improves the code of others and incorporates the impact of other systems with these changes.",
					"level": 2
				},
				{
					"question": "Ensures the solution does not create more technical debt.",
					"level": 2
				},
				{
					"question": "Performs objective code assessments.",
					"level": 2
				},
				{
					"question": "Quickly understands different types of business needs and chooses the best solutions (technologies & architectural designs).",
					"level": 3
				},
				{
					"question": "Advises and proposes improvements in the change and release process and translates this to coding policy.",
					"level": 3
				},
				{
					"question": "Takes the lead in the discussion on technology.",
					"level": 3
				},
				{
					"question": "Can implement a library/utility and design an API from scratch.",
					"level": 3
				},
				{
					"question": "Is able to create and maintain a standalone library with sophisticated API from scratch.",
					"level": 4
				},
				{
					"question": "Has and shares a vision regards to the technical state of the future IT landscape and embeds that within the organisation.",
					"level": 4
				},
				{
					"question": "Is the point of contact for architects and senior management to talk about the technology in depth.",
					"level": 4
				},
				{
					"question": "Makes decisions based on the amount of knowledge they have, technology as a tool to fix the problem at han.",
					"level": 4
				}
			]
		},
		{
			"slug": "t",
			"questions": [
				{
					"question": "Executes structured manual or automated test cases.",
					"level": 0
				},
				{
					"question": "Records and communicates findings so that they are clear and reproducible.",
					"level": 0
				},
				{
					"question": "Specifies test cases based on acceptance criteria.",
					"level": 0
				},
				{
					"question": "Is able to update existing cases to match new requirements.",
					"level": 1
				},
				{
					"question": "In case of findings, provides analysis and information needed to resolve the issue.",
					"level": 1
				},
				{
					"question": "Guides other colleagues in carrying out tests.",
					"level": 1
				},
				{
					"question": "Applies exploratory testing based on the basis of domain knowledge.",
					"level": 1
				},
				{
					"question": "Is familiar with the Testing Pyramid concept.",
					"level": 1
				},
				{
					"question": "Sets up and writes tests.",
					"level": 2
				},
				{
					"question": "Improves existing test tool setups.",
					"level": 2
				},
				{
					"question": "Designs tests with the end user in mind.",
					"level": 2
				},
				{
					"question": "Evaluates the application performance and comes up with ways to test this automatically.",
					"level": 2
				},
				{
					"question": "Perfoms a product risk analysis to achieve the most efficient test coverage possible.",
					"level": 2
				},
				{
					"question": "Understands the impact and implied risks of failing tests.",
					"level": 2
				},
				{
					"question": "Sets up a test strategy, selects the most appropriate test tool, implements and configures it.",
					"level": 3
				},
				{
					"question": "Understands relationships/dependencies and risks between systems, teams and business units.",
					"level": 3
				},
				{
					"question": "Sets standards for test artifacts and metrics.",
					"level": 3
				},
				{
					"question": "Draws and implements a cross-team test strategy.",
					"level": 3
				},
				{
					"question": "Provides improvements for test infrastructure and test data.",
					"level": 3
				},
				{
					"question": "Advocates for testing culture.",
					"level": 4
				},
				{
					"question": "Innovates the testing field within organisation.",
					"level": 4
				},
				{
					"question": "Actively evaluates the quality standards and expands/improves them as necessary.",
					"level": 4
				},
				{
					"question": "Advises and challenges senior management on quality-related topics.",
					"level": 4
				}
			]
		},
		{
			"slug": "ci",
			"questions": [
				{
					"question": "Is familiar with at least one CI/CD solution.",
					"level": 0
				},
				{
					"question": "Understands the actions necessary to move an app through a CI/CD pipeline (Dev -> Tst -> Acc -> Prd)).",
					"level": 0
				},
				{
					"question": "Checks automated testing logs and makes use of existing version control system.",
					"level": 0
				},
				{
					"question": "Can add additional steps and stages to an existing pipeline when needed.",
					"level": 1
				},
				{
					"question": "Has a clear view on what the end-product and result of the CI pipeline is.",
					"level": 1
				},
				{
					"question": "Integrates test scripts into the CI/CD pipeline.",
					"level": 1
				},
				{
					"question": "Sets up a CI/CD pipeline from scratch.",
					"level": 2
				},
				{
					"question": "Makes sure the pipeline is set up correctly.",
					"level": 2
				},
				{
					"question": "Identifies improvements that can be made in existing pipelines.",
					"level": 2
				},
				{
					"question": "Implements requirements for the CI/CD pipeline.",
					"level": 2
				},
				{
					"question": "Reviews changes to the pipeline made by others.",
					"level": 2
				},
				{
					"question": "Shapes the release-process together with CI/CD pipeline.",
					"level": 3
				},
				{
					"question": "Actively promotes trust in the CI/CD pipeline within the organization.",
					"level": 3
				},
				{
					"question": "Makes (performance) improvements to the pipeline itself based on metrics.",
					"level": 3
				},
				{
					"question": "Sets standards for the CI/CD pipeline.",
					"level": 3
				},
				{
					"question": "Assesses new CI/CD tooling and implements it if necessary.",
					"level": 3
				},
				{
					"question": "Aligns with other teams/business units regarding CI/CD strategy.",
					"level": 3
				},
				{
					"question": "Actively coaches others to automate delivery of software.",
					"level": 4
				},
				{
					"question": "Shares knowledge and experience with others, aiming to push the level of CI/CD further within organisation.",
					"level": 4
				},
				{
					"question": "Takes responsibility and assumes ownership of the quality of the entire CI/CD pipeline.",
					"level": 4
				}
			]
		},
		{
			"slug": "u",
			"questions": [
				{
					"question": "Knows how to use existing style guidelines and how to apply existing design principles.",
					"level": 0
				},
				{
					"question": "Makes use of ready made UI patterns and libraries.",
					"level": 0
				},
				{
					"question": "Is aware of the impact of shapes/colors/sizes in user interaction with the system.",
					"level": 0
				},
				{
					"question": "Independenty can extrapolate existing style guidelines to yet undefined areas.",
					"level": 1
				},
				{
					"question": "Implements new visual elements semantically.",
					"level": 1
				},
				{
					"question": "Is aware of accessibility features and requirements.",
					"level": 1
				},
				{
					"question": "Has experience with working with various prototyping tools.",
					"level": 1
				},
				{
					"question": "Is able to critically asses designs and choose most efficient one for users to achieve their goals.",
					"level": 2
				},
				{
					"question": "Can take functional requirements and independently come up with an implementation with a good UX approach.",
					"level": 2
				},
				{
					"question": "Is able to coach new team members on which style guides and UI/UX principles to use and why.",
					"level": 2
				},
				{
					"question": "Processes user feedback and makes design decisions based on that.",
					"level": 2
				},
				{
					"question": "Is aware of market standards and patterns for solving interaction goals.",
					"level": 2
				},
				{
					"question": "Is able to set up a style guide and implement component library from scratch.",
					"level": 3
				},
				{
					"question": "Oversees consistent implementation of styleguide/component library accross the whole platform.",
					"level": 3
				},
				{
					"question": "Is capable of conducting user feedback sessions.",
					"level": 3
				},
				{
					"question": "Enforces accessability requirements accross whole platform.",
					"level": 3
				},
				{
					"question": "Challenges business requirements and advises on better UX approaches.",
					"level": 3
				},
				{
					"question": "Challenges existing UI/UX approaches and pushes to impove.",
					"level": 3
				},
				{
					"question": "Establishes a vision and leads the way for UX within a project/organisation.",
					"level": 4
				},
				{
					"question": "Provides feedback and inspiration on the project/organisation UX approach based on the state of the industry.",
					"level": 4
				}
			]
		},
		{
			"slug": "i",
			"questions": [
				{
					"question": "Knows the most important infra components and key technologies which are used within the organisation.",
					"level": 0
				},
				{
					"question": "Knows how to execute basic predefined infrastructure tasks.",
					"level": 0
				},
				{
					"question": "Understands configuration options of infrastructure components and characteristics (type, platform, performance, sizing, availability etc.).",
					"level": 1
				},
				{
					"question": "Understands the infrastructure architecture principles and standards and applies them.",
					"level": 1
				},
				{
					"question": "Is able to set up new infrastructure components based on pre-specified requirements.",
					"level": 1
				},
				{
					"question": "Understands actions that impact availability and continuity configurations (e.g, backup & restore/disaster recovery).",
					"level": 1
				},
				{
					"question": "Addresses and resolves more familiar infrastructure issues.",
					"level": 1
				},
				{
					"question": "Autonomously solves more complex infrastructure issues.",
					"level": 2
				},
				{
					"question": "Oversees the implications of tactical decisions on the IT infrastructure domain.",
					"level": 2
				},
				{
					"question": "Translates design into infrastructure as code.",
					"level": 2
				},
				{
					"question": "Optimizes financial implications of design choices.",
					"level": 2
				},
				{
					"question": "Manages lifecycle of applications and patches.",
					"level": 2
				},
				{
					"question": "Takes in consideration the hosting strategy (cloud vs. on-prem) to identify the most efficient resource usage.",
					"level": 2
				},
				{
					"question": "Sets up and configures a monitoring workflow and knows which metrics to track.",
					"level": 2
				},
				{
					"question": "Has a deep understanding of the concepts, technologies and processes used within the infra domain.",
					"level": 3
				},
				{
					"question": "Is able to solve complex issues and can address alternatives.",
					"level": 3
				},
				{
					"question": "Makes strategic decisions and oversees the impact on the IT infra domain.",
					"level": 3
				},
				{
					"question": "Challenges infrastructure architecture principles and standards.",
					"level": 3
				},
				{
					"question": "Uses monitoring output as input to decide on infrastructure optimizations.",
					"level": 3
				},
				{
					"question": "Optimizes failover strategy.",
					"level": 3
				},
				{
					"question": "Has authoritative knowledge and deep understanding of the concepts, technologies and processes used within the IT Infrastructure domain.",
					"level": 4
				},
				{
					"question": "Creates and develops a personal vision of different alternatives/strategies in infrastructure and gets support for this vision within the organization.",
					"level": 4
				}
			]
		},
		{
			"slug": "s",
			"questions": [
				{
					"question": "Understands why security is important.",
					"level": 0
				},
				{
					"question": "Is aware about the concept of sensitive data (BSN, personal data, salary, revenue, financial information etc..",
					"level": 0
				},
				{
					"question": "Is aware about GDPR principles.",
					"level": 0
				},
				{
					"question": "Is aware about different threats.",
					"level": 0
				},
				{
					"question": "Writes code with security principles in mind.",
					"level": 1
				},
				{
					"question": "Identifies security gaps in own work and team assignments.",
					"level": 1
				},
				{
					"question": "Actively works towards closing this gap.",
					"level": 1
				},
				{
					"question": "Promotes the secure by design principle.",
					"level": 1
				},
				{
					"question": "Participates in risk assessments.",
					"level": 1
				},
				{
					"question": "Is familiar with security pyramid concept.",
					"level": 1
				},
				{
					"question": "Understands the security & compliance standards, policies and procedures of his/her team.",
					"level": 2
				},
				{
					"question": "Challenges the security of new features.",
					"level": 2
				},
				{
					"question": "Ensures that security risks are analysed and managed with respect to data and information security standards and policies.",
					"level": 2
				},
				{
					"question": "Represents the security stand of the own team.",
					"level": 2
				},
				{
					"question": "Is involved in risk assessments and Business Impact Analysis.",
					"level": 2
				},
				{
					"question": "Is aware of the rists and vulnerabilities outlined by OWASP top 10 for Web.",
					"level": 2
				},
				{
					"question": "Reviews security incidents.",
					"level": 3
				},
				{
					"question": "Implements necessary security techniques.",
					"level": 3
				},
				{
					"question": "Defines, proposes and implements necessary security techniques, key controls and practises in compliance with security policy and regulations.",
					"level": 3
				},
				{
					"question": "Makes recommendations for security guidelines and policy standards to ensure continuous improvement of security provision.",
					"level": 3
				},
				{
					"question": "Provides leadership for enhancing the integrity, confidentiality and availability of data.",
					"level": 3
				},
				{
					"question": "Proactively works on mitigating risks and reducing security flaw.",
					"level": 3
				},
				{
					"question": "Oversees IT security risks throughout the entire organisation.",
					"level": 4
				},
				{
					"question": "Participates in security governance process and its succession.",
					"level": 4
				},
				{
					"question": "Is the go-to person for assesing and mitigating risks for other teams.",
					"level": 4
				},
				{
					"question": "Advises senior management on security topics.",
					"level": 4
				}
			]
		},
		{
			"slug": "l",
			"questions": [
				{
					"question": "Can step up at times and take leading role in a team.",
					"level": 0
				},
				{
					"question": "Is able to mediate and solve simple problems within a group.",
					"level": 0
				},
				{
					"question": "Needs a mentor figure or further training to progress with leading.",
					"level": 0
				},
				{
					"question": "Has effective communication skills and knows how to tailor a good message.",
					"level": 1
				},
				{
					"question": "Acts with integrity in private and in public.",
					"level": 1
				},
				{
					"question": "Knows the basics on how to navigate sensitive situations in a group.",
					"level": 1
				},
				{
					"question": "Proactively nurtures conversations on how to share knowledge and develop a shared vision inside team.",
					"level": 1
				},
				{
					"question": "Is aware of the accountability involved in leading a team.",
					"level": 1
				},
				{
					"question": "Proactively builds and improves trust and loyal relationships between team members.",
					"level": 2
				},
				{
					"question": "Is at ease and comfortable being in lead of a group most of the time.",
					"level": 2
				},
				{
					"question": "Creates opportunities for knowledge sharing and inspires the team to participate.",
					"level": 2
				},
				{
					"question": "Knows when to delegate, to whom and what.",
					"level": 2
				},
				{
					"question": "Can skillfully identify, prevent and resolve conflicts.",
					"level": 2
				},
				{
					"question": "Understands that a healthy climate and work-life balance within the team leads to better long term performance.",
					"level": 2
				},
				{
					"question": "Participates in the process to include new team members and identify what personality(ies) would fit the current team.",
					"level": 2
				},
				{
					"question": "Fulfills business expectations with regards to deliverables and inspires the team to achieve the goal.",
					"level": 2
				},
				{
					"question": "Is highly valued from (or forms part of) senior management.",
					"level": 3
				},
				{
					"question": "Is able to effectively manage a (distributed) team as a self-sufficient unit.",
					"level": 3
				},
				{
					"question": "Aligns team strategy with other cross-functional teams and provides input for organizational improvement.",
					"level": 3
				},
				{
					"question": "Innovates the way forward by offering a compelling vision for the whole team/organisation.",
					"level": 4
				},
				{
					"question": "Inspires whole organisation or industry with his/her approach, goals and values.",
					"level": 4
				},
				{
					"question": "Other team leads might often seek his/her input and advice.",
					"level": 4
				},
				{
					"question": "Helps others to reach their full potential.",
					"level": 4
				}
			]
		},
		{
			"slug": "c",
			"questions": [
				{
					"question": "Is aware of importance of clear communication good work ethic.",
					"level": 0
				},
				{
					"question": "Understanding that continous learning is part of the job.",
					"level": 0
				},
				{
					"question": "Has positive attitude and willingness to cooperate.",
					"level": 0
				},
				{
					"question": "Critical thinking and professional mindset when advising clients.",
					"level": 1
				},
				{
					"question": "Empathy with peers and subordinates.",
					"level": 1
				},
				{
					"question": "Is able to manage time effectively.",
					"level": 1
				},
				{
					"question": "Has effective communication skills and knows how to tailor a good message.",
					"level": 2
				},
				{
					"question": "Is comfortable with speaking in public.",
					"level": 2
				},
				{
					"question": "Good interpresonal skills.",
					"level": 2
				},
				{
					"question": "Able to work under pressure.",
					"level": 2
				},
				{
					"question": "Has mastered presenting information and own arguments well.",
					"level": 3
				},
				{
					"question": "Is able to communicate effectively with various personalities.",
					"level": 3
				},
				{
					"question": "Utilizes intra-organisation network and is able to leverage it for finding solutions to problems.",
					"level": 3
				},
				{
					"question": "Can handle negotiations on behalf of employer or client.",
					"level": 4
				},
				{
					"question": "Is able to leverage own network for business development.",
					"level": 4
				},
				{
					"question": "Proactively upsells and finds a fit between problem and consulting services.",
					"level": 4
				},
				{
					"question": "Is an expert in at least 1 another specific domain.",
					"level": 4
				}
			]
		}
	]
}